Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/afec.h
/* -------- AFEC_EMR : (AFEC Offset: 0x08) (R/W 32) AFEC Extended Mode Register -------- */
#define AFEC_EMR_CMPMODE_Pos                  _UINT32_(0)                                          /* (AFEC_EMR) Comparison Mode Position */
#define AFEC_EMR_CMPMODE_Msk                  (_UINT32_(0x3) << AFEC_EMR_CMPMODE_Pos)              /* (AFEC_EMR) Comparison Mode Mask */
#define AFEC_EMR_CMPMODE(value)               (AFEC_EMR_CMPMODE_Msk & (_UINT32_(value) << AFEC_EMR_CMPMODE_Pos)) /* Assigment of value for CMPMODE in the AFEC_EMR register */
#define   AFEC_EMR_CMPMODE_LOW_Val            _UINT32_(0x0)                                        /* (AFEC_EMR) Generates an event when the converted data is lower than the low threshold of the window.  */
#define   AFEC_EMR_CMPMODE_HIGH_Val           _UINT32_(0x1)                                        /* (AFEC_EMR) Generates an event when the converted data is higher than the high threshold of the window.  */
#define   AFEC_EMR_CMPMODE_IN_Val             _UINT32_(0x2)                                        /* (AFEC_EMR) Generates an event when the converted data is in the comparison window.  */
#define   AFEC_EMR_CMPMODE_OUT_Val            _UINT32_(0x3)                                        /* (AFEC_EMR) Generates an event when the converted data is out of the comparison window.  */
#define AFEC_EMR_CMPMODE_LOW                  (AFEC_EMR_CMPMODE_LOW_Val << AFEC_EMR_CMPMODE_Pos)   /* (AFEC_EMR) Generates an event when the converted data is lower than the low threshold of the window. Position  */
#define AFEC_EMR_CMPMODE_HIGH                 (AFEC_EMR_CMPMODE_HIGH_Val << AFEC_EMR_CMPMODE_Pos)  /* (AFEC_EMR) Generates an event when the converted data is higher than the high threshold of the window. Position  */
#define AFEC_EMR_CMPMODE_IN                   (AFEC_EMR_CMPMODE_IN_Val << AFEC_EMR_CMPMODE_Pos)    /* (AFEC_EMR) Generates an event when the converted data is in the comparison window. Position  */
#define AFEC_EMR_CMPMODE_OUT                  (AFEC_EMR_CMPMODE_OUT_Val << AFEC_EMR_CMPMODE_Pos)   /* (AFEC_EMR) Generates an event when the converted data is out of the comparison window. Position  */
#define AFEC_EMR_CMPSEL_Pos                   _UINT32_(3)                                          /* (AFEC_EMR) Comparison Selected Channel Position */
#define AFEC_EMR_CMPSEL_Msk                   (_UINT32_(0x1F) << AFEC_EMR_CMPSEL_Pos)              /* (AFEC_EMR) Comparison Selected Channel Mask */
#define AFEC_EMR_CMPSEL(value)                (AFEC_EMR_CMPSEL_Msk & (_UINT32_(value) << AFEC_EMR_CMPSEL_Pos)) /* Assigment of value for CMPSEL in the AFEC_EMR register */
#define AFEC_EMR_CMPALL_Pos                   _UINT32_(9)                                          /* (AFEC_EMR) Compare All Channels Position */
#define AFEC_EMR_CMPALL_Msk                   (_UINT32_(0x1) << AFEC_EMR_CMPALL_Pos)               /* (AFEC_EMR) Compare All Channels Mask */
#define AFEC_EMR_CMPALL(value)                (AFEC_EMR_CMPALL_Msk & (_UINT32_(value) << AFEC_EMR_CMPALL_Pos)) /* Assigment of value for CMPALL in the AFEC_EMR register */
#define AFEC_EMR_CMPFILTER_Pos                _UINT32_(12)                                         /* (AFEC_EMR) Compare Event Filtering Position */
#define AFEC_EMR_CMPFILTER_Msk                (_UINT32_(0x3) << AFEC_EMR_CMPFILTER_Pos)            /* (AFEC_EMR) Compare Event Filtering Mask */
#define AFEC_EMR_CMPFILTER(value)             (AFEC_EMR_CMPFILTER_Msk & (_UINT32_(value) << AFEC_EMR_CMPFILTER_Pos)) /* Assigment of value for CMPFILTER in the AFEC_EMR register */
#define AFEC_EMR_RES_Pos                      _UINT32_(16)                                         /* (AFEC_EMR) Resolution Position */
#define AFEC_EMR_RES_Msk                      (_UINT32_(0x7) << AFEC_EMR_RES_Pos)                  /* (AFEC_EMR) Resolution Mask */
#define AFEC_EMR_RES(value)                   (AFEC_EMR_RES_Msk & (_UINT32_(value) << AFEC_EMR_RES_Pos)) /* Assigment of value for RES in the AFEC_EMR register */
#define   AFEC_EMR_RES_NO_AVERAGE_Val         _UINT32_(0x0)                                        /* (AFEC_EMR) 12-bit resolution, AFE sample rate is maximum (no averaging).  */
#define   AFEC_EMR_RES_OSR4_Val               _UINT32_(0x2)                                        /* (AFEC_EMR) 13-bit resolution, AFE sample rate divided by 4 (averaging).  */
#define   AFEC_EMR_RES_OSR16_Val              _UINT32_(0x3)                                        /* (AFEC_EMR) 14-bit resolution, AFE sample rate divided by 16 (averaging).  */
#define   AFEC_EMR_RES_OSR64_Val              _UINT32_(0x4)                                        /* (AFEC_EMR) 15-bit resolution, AFE sample rate divided by 64 (averaging).  */
#define   AFEC_EMR_RES_OSR256_Val             _UINT32_(0x5)                                        /* (AFEC_EMR) 16-bit resolution, AFE sample rate divided by 256 (averaging).  */
#define AFEC_EMR_RES_NO_AVERAGE               (AFEC_EMR_RES_NO_AVERAGE_Val << AFEC_EMR_RES_Pos)    /* (AFEC_EMR) 12-bit resolution, AFE sample rate is maximum (no averaging). Position  */
#define AFEC_EMR_RES_OSR4                     (AFEC_EMR_RES_OSR4_Val << AFEC_EMR_RES_Pos)          /* (AFEC_EMR) 13-bit resolution, AFE sample rate divided by 4 (averaging). Position  */
#define AFEC_EMR_RES_OSR16                    (AFEC_EMR_RES_OSR16_Val << AFEC_EMR_RES_Pos)         /* (AFEC_EMR) 14-bit resolution, AFE sample rate divided by 16 (averaging). Position  */
#define AFEC_EMR_RES_OSR64                    (AFEC_EMR_RES_OSR64_Val << AFEC_EMR_RES_Pos)         /* (AFEC_EMR) 15-bit resolution, AFE sample rate divided by 64 (averaging). Position  */
#define AFEC_EMR_RES_OSR256                   (AFEC_EMR_RES_OSR256_Val << AFEC_EMR_RES_Pos)        /* (AFEC_EMR) 16-bit resolution, AFE sample rate divided by 256 (averaging). Position  */
#define AFEC_EMR_TAG_Pos                      _UINT32_(24)                                         /* (AFEC_EMR) TAG of the AFEC_LDCR Position */
#define AFEC_EMR_TAG_Msk                      (_UINT32_(0x1) << AFEC_EMR_TAG_Pos)                  /* (AFEC_EMR) TAG of the AFEC_LDCR Mask */
#define AFEC_EMR_TAG(value)                   (AFEC_EMR_TAG_Msk & (_UINT32_(value) << AFEC_EMR_TAG_Pos)) /* Assigment of value for TAG in the AFEC_EMR register */
#define AFEC_EMR_STM_Pos                      _UINT32_(25)                                         /* (AFEC_EMR) Single Trigger Mode Position */
#define AFEC_EMR_STM_Msk                      (_UINT32_(0x1) << AFEC_EMR_STM_Pos)                  /* (AFEC_EMR) Single Trigger Mode Mask */
#define AFEC_EMR_STM(value)                   (AFEC_EMR_STM_Msk & (_UINT32_(value) << AFEC_EMR_STM_Pos)) /* Assigment of value for STM in the AFEC_EMR register */
#define AFEC_EMR_SIGNMODE_Pos                 _UINT32_(28)                                         /* (AFEC_EMR) Sign Mode Position */
#define AFEC_EMR_SIGNMODE_Msk                 (_UINT32_(0x3) << AFEC_EMR_SIGNMODE_Pos)             /* (AFEC_EMR) Sign Mode Mask */
#define AFEC_EMR_SIGNMODE(value)              (AFEC_EMR_SIGNMODE_Msk & (_UINT32_(value) << AFEC_EMR_SIGNMODE_Pos)) /* Assigment of value for SIGNMODE in the AFEC_EMR register */
#define   AFEC_EMR_SIGNMODE_SE_UNSG_DF_SIGN_Val _UINT32_(0x0)                                        /* (AFEC_EMR) Single-Ended channels: Unsigned conversions.Differential channels: Signed conversions.  */
#define   AFEC_EMR_SIGNMODE_SE_SIGN_DF_UNSG_Val _UINT32_(0x1)                                        /* (AFEC_EMR) Single-Ended channels: Signed conversions.Differential channels: Unsigned conversions.  */
#define   AFEC_EMR_SIGNMODE_ALL_UNSIGNED_Val  _UINT32_(0x2)                                        /* (AFEC_EMR) All channels: Unsigned conversions.  */
#define   AFEC_EMR_SIGNMODE_ALL_SIGNED_Val    _UINT32_(0x3)                                        /* (AFEC_EMR) All channels: Signed conversions.  */
#define AFEC_EMR_SIGNMODE_SE_UNSG_DF_SIGN     (AFEC_EMR_SIGNMODE_SE_UNSG_DF_SIGN_Val << AFEC_EMR_SIGNMODE_Pos) /* (AFEC_EMR) Single-Ended channels: Unsigned conversions.Differential channels: Signed conversions. Position  */
#define AFEC_EMR_SIGNMODE_SE_SIGN_DF_UNSG     (AFEC_EMR_SIGNMODE_SE_SIGN_DF_UNSG_Val << AFEC_EMR_SIGNMODE_Pos) /* (AFEC_EMR) Single-Ended channels: Signed conversions.Differential channels: Unsigned conversions. Position  */
#define AFEC_EMR_SIGNMODE_ALL_UNSIGNED        (AFEC_EMR_SIGNMODE_ALL_UNSIGNED_Val << AFEC_EMR_SIGNMODE_Pos) /* (AFEC_EMR) All channels: Unsigned conversions. Position  */
#define AFEC_EMR_SIGNMODE_ALL_SIGNED          (AFEC_EMR_SIGNMODE_ALL_SIGNED_Val << AFEC_EMR_SIGNMODE_Pos) /* (AFEC_EMR) All channels: Signed conversions. Position  */
#define AFEC_EMR_Msk                          _UINT32_(0x330732FB)                                 /* (AFEC_EMR) Register Mask  */


/* -------- AFEC_SEQ1R : (AFEC Offset: 0x0C) (R/W 32) AFEC Channel Sequence 1 Register -------- */
#define AFEC_SEQ1R_USCH0_Pos                  _UINT32_(0)                                          /* (AFEC_SEQ1R) User Sequence Number 0 Position */
#define AFEC_SEQ1R_USCH0_Msk                  (_UINT32_(0xF) << AFEC_SEQ1R_USCH0_Pos)              /* (AFEC_SEQ1R) User Sequence Number 0 Mask */
#define AFEC_SEQ1R_USCH0(value)               (AFEC_SEQ1R_USCH0_Msk & (_UINT32_(value) << AFEC_SEQ1R_USCH0_Pos)) /* Assigment of value for USCH0 in the AFEC_SEQ1R register */
#define AFEC_SEQ1R_USCH1_Pos                  _UINT32_(4)                                          /* (AFEC_SEQ1R) User Sequence Number 1 Position */
#define AFEC_SEQ1R_USCH1_Msk                  (_UINT32_(0xF) << AFEC_SEQ1R_USCH1_Pos)              /* (AFEC_SEQ1R) User Sequence Number 1 Mask */
#define AFEC_SEQ1R_USCH1(value)               (AFEC_SEQ1R_USCH1_Msk & (_UINT32_(value) << AFEC_SEQ1R_USCH1_Pos)) /* Assigment of value for USCH1 in the AFEC_SEQ1R register */
#define AFEC_SEQ1R_USCH2_Pos                  _UINT32_(8)                                          /* (AFEC_SEQ1R) User Sequence Number 2 Position */
#define AFEC_SEQ1R_USCH2_Msk                  (_UINT32_(0xF) << AFEC_SEQ1R_USCH2_Pos)              /* (AFEC_SEQ1R) User Sequence Number 2 Mask */
#define AFEC_SEQ1R_USCH2(value)               (AFEC_SEQ1R_USCH2_Msk & (_UINT32_(value) << AFEC_SEQ1R_USCH2_Pos)) /* Assigment of value for USCH2 in the AFEC_SEQ1R register */
#define AFEC_SEQ1R_USCH3_Pos                  _UINT32_(12)                                         /* (AFEC_SEQ1R) User Sequence Number 3 Position */
#define AFEC_SEQ1R_USCH3_Msk                  (_UINT32_(0xF) << AFEC_SEQ1R_USCH3_Pos)              /* (AFEC_SEQ1R) User Sequence Number 3 Mask */
#define AFEC_SEQ1R_USCH3(value)               (AFEC_SEQ1R_USCH3_Msk & (_UINT32_(value) << AFEC_SEQ1R_USCH3_Pos)) /* Assigment of value for USCH3 in the AFEC_SEQ1R register */
#define AFEC_SEQ1R_USCH4_Pos                  _UINT32_(16)                                         /* (AFEC_SEQ1R) User Sequence Number 4 Position */
#define AFEC_SEQ1R_USCH4_Msk                  (_UINT32_(0xF) << AFEC_SEQ1R_USCH4_Pos)              /* (AFEC_SEQ1R) User Sequence Number 4 Mask */
#define AFEC_SEQ1R_USCH4(value)               (AFEC_SEQ1R_USCH4_Msk & (_UINT32_(value) << AFEC_SEQ1R_USCH4_Pos)) /* Assigment of value for USCH4 in the AFEC_SEQ1R register */
#define AFEC_SEQ1R_USCH5_Pos                  _UINT32_(20)                                         /* (AFEC_SEQ1R) User Sequence Number 5 Position */
#define AFEC_SEQ1R_USCH5_Msk                  (_UINT32_(0xF) << AFEC_SEQ1R_USCH5_Pos)              /* (AFEC_SEQ1R) User Sequence Number 5 Mask */
#define AFEC_SEQ1R_USCH5(value)               (AFEC_SEQ1R_USCH5_Msk & (_UINT32_(value) << AFEC_SEQ1R_USCH5_Pos)) /* Assigment of value for USCH5 in the AFEC_SEQ1R register */
#define AFEC_SEQ1R_USCH6_Pos                  _UINT32_(24)                                         /* (AFEC_SEQ1R) User Sequence Number 6 Position */
#define AFEC_SEQ1R_USCH6_Msk                  (_UINT32_(0xF) << AFEC_SEQ1R_USCH6_Pos)              /* (AFEC_SEQ1R) User Sequence Number 6 Mask */
#define AFEC_SEQ1R_USCH6(value)               (AFEC_SEQ1R_USCH6_Msk & (_UINT32_(value) << AFEC_SEQ1R_USCH6_Pos)) /* Assigment of value for USCH6 in the AFEC_SEQ1R register */
#define AFEC_SEQ1R_USCH7_Pos                  _UINT32_(28)                                         /* (AFEC_SEQ1R) User Sequence Number 7 Position */
#define AFEC_SEQ1R_USCH7_Msk                  (_UINT32_(0xF) << AFEC_SEQ1R_USCH7_Pos)              /* (AFEC_SEQ1R) User Sequence Number 7 Mask */
#define AFEC_SEQ1R_USCH7(value)               (AFEC_SEQ1R_USCH7_Msk & (_UINT32_(value) << AFEC_SEQ1R_USCH7_Pos)) /* Assigment of value for USCH7 in the AFEC_SEQ1R register */
#define AFEC_SEQ1R_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (AFEC_SEQ1R) Register Mask  */


/* -------- AFEC_SEQ2R : (AFEC Offset: 0x10) (R/W 32) AFEC Channel Sequence 2 Register -------- */
#define AFEC_SEQ2R_USCH8_Pos                  _UINT32_(0)                                          /* (AFEC_SEQ2R) User Sequence Number 8 Position */
#define AFEC_SEQ2R_USCH8_Msk                  (_UINT32_(0xF) << AFEC_SEQ2R_USCH8_Pos)              /* (AFEC_SEQ2R) User Sequence Number 8 Mask */
#define AFEC_SEQ2R_USCH8(value)               (AFEC_SEQ2R_USCH8_Msk & (_UINT32_(value) << AFEC_SEQ2R_USCH8_Pos)) /* Assigment of value for USCH8 in the AFEC_SEQ2R register */
#define AFEC_SEQ2R_USCH9_Pos                  _UINT32_(4)                                          /* (AFEC_SEQ2R) User Sequence Number 9 Position */
#define AFEC_SEQ2R_USCH9_Msk                  (_UINT32_(0xF) << AFEC_SEQ2R_USCH9_Pos)              /* (AFEC_SEQ2R) User Sequence Number 9 Mask */
#define AFEC_SEQ2R_USCH9(value)               (AFEC_SEQ2R_USCH9_Msk & (_UINT32_(value) << AFEC_SEQ2R_USCH9_Pos)) /* Assigment of value for USCH9 in the AFEC_SEQ2R register */
#define AFEC_SEQ2R_USCH10_Pos                 _UINT32_(8)                                          /* (AFEC_SEQ2R) User Sequence Number 10 Position */
#define AFEC_SEQ2R_USCH10_Msk                 (_UINT32_(0xF) << AFEC_SEQ2R_USCH10_Pos)             /* (AFEC_SEQ2R) User Sequence Number 10 Mask */
#define AFEC_SEQ2R_USCH10(value)              (AFEC_SEQ2R_USCH10_Msk & (_UINT32_(value) << AFEC_SEQ2R_USCH10_Pos)) /* Assigment of value for USCH10 in the AFEC_SEQ2R register */
#define AFEC_SEQ2R_USCH11_Pos                 _UINT32_(12)                                         /* (AFEC_SEQ2R) User Sequence Number 11 Position */
#define AFEC_SEQ2R_USCH11_Msk                 (_UINT32_(0xF) << AFEC_SEQ2R_USCH11_Pos)             /* (AFEC_SEQ2R) User Sequence Number 11 Mask */
#define AFEC_SEQ2R_USCH11(value)              (AFEC_SEQ2R_USCH11_Msk & (_UINT32_(value) << AFEC_SEQ2R_USCH11_Pos)) /* Assigment of value for USCH11 in the AFEC_SEQ2R register */
#define AFEC_SEQ2R_Msk                        _UINT32_(0x0000FFFF)                                 /* (AFEC_SEQ2R) Register Mask  */


/* -------- AFEC_CHER : (AFEC Offset: 0x14) ( /W 32) AFEC Channel Enable Register -------- */
#define AFEC_CHER_CH0_Pos                     _UINT32_(0)                                          /* (AFEC_CHER) Channel 0 Enable Position */
#define AFEC_CHER_CH0_Msk                     (_UINT32_(0x1) << AFEC_CHER_CH0_Pos)                 /* (AFEC_CHER) Channel 0 Enable Mask */
#define AFEC_CHER_CH0(value)                  (AFEC_CHER_CH0_Msk & (_UINT32_(value) << AFEC_CHER_CH0_Pos)) /* Assigment of value for CH0 in the AFEC_CHER register */
#define AFEC_CHER_CH1_Pos                     _UINT32_(1)                                          /* (AFEC_CHER) Channel 1 Enable Position */
#define AFEC_CHER_CH1_Msk                     (_UINT32_(0x1) << AFEC_CHER_CH1_Pos)                 /* (AFEC_CHER) Channel 1 Enable Mask */
#define AFEC_CHER_CH1(value)                  (AFEC_CHER_CH1_Msk & (_UINT32_(value) << AFEC_CHER_CH1_Pos)) /* Assigment of value for CH1 in the AFEC_CHER register */
#define AFEC_CHER_CH2_Pos                     _UINT32_(2)                                          /* (AFEC_CHER) Channel 2 Enable Position */
#define AFEC_CHER_CH2_Msk                     (_UINT32_(0x1) << AFEC_CHER_CH2_Pos)                 /* (AFEC_CHER) Channel 2 Enable Mask */
#define AFEC_CHER_CH2(value)                  (AFEC_CHER_CH2_Msk & (_UINT32_(value) << AFEC_CHER_CH2_Pos)) /* Assigment of value for CH2 in the AFEC_CHER register */
#define AFEC_CHER_CH3_Pos                     _UINT32_(3)                                          /* (AFEC_CHER) Channel 3 Enable Position */
#define AFEC_CHER_CH3_Msk                     (_UINT32_(0x1) << AFEC_CHER_CH3_Pos)                 /* (AFEC_CHER) Channel 3 Enable Mask */
#define AFEC_CHER_CH3(value)                  (AFEC_CHER_CH3_Msk & (_UINT32_(value) << AFEC_CHER_CH3_Pos)) /* Assigment of value for CH3 in the AFEC_CHER register */
#define AFEC_CHER_CH4_Pos                     _UINT32_(4)                                          /* (AFEC_CHER) Channel 4 Enable Position */
#define AFEC_CHER_CH4_Msk                     (_UINT32_(0x1) << AFEC_CHER_CH4_Pos)                 /* (AFEC_CHER) Channel 4 Enable Mask */
#define AFEC_CHER_CH4(value)                  (AFEC_CHER_CH4_Msk & (_UINT32_(value) << AFEC_CHER_CH4_Pos)) /* Assigment of value for CH4 in the AFEC_CHER register */
#define AFEC_CHER_CH5_Pos                     _UINT32_(5)                                          /* (AFEC_CHER) Channel 5 Enable Position */
#define AFEC_CHER_CH5_Msk                     (_UINT32_(0x1) << AFEC_CHER_CH5_Pos)                 /* (AFEC_CHER) Channel 5 Enable Mask */
#define AFEC_CHER_CH5(value)                  (AFEC_CHER_CH5_Msk & (_UINT32_(value) << AFEC_CHER_CH5_Pos)) /* Assigment of value for CH5 in the AFEC_CHER register */
#define AFEC_CHER_CH6_Pos                     _UINT32_(6)                                          /* (AFEC_CHER) Channel 6 Enable Position */
#define AFEC_CHER_CH6_Msk                     (_UINT32_(0x1) << AFEC_CHER_CH6_Pos)                 /* (AFEC_CHER) Channel 6 Enable Mask */
#define AFEC_CHER_CH6(value)                  (AFEC_CHER_CH6_Msk & (_UINT32_(value) << AFEC_CHER_CH6_Pos)) /* Assigment of value for CH6 in the AFEC_CHER register */
#define AFEC_CHER_CH7_Pos                     _UINT32_(7)                                          /* (AFEC_CHER) Channel 7 Enable Position */
#define AFEC_CHER_CH7_Msk                     (_UINT32_(0x1) << AFEC_CHER_CH7_Pos)                 /* (AFEC_CHER) Channel 7 Enable Mask */
#define AFEC_CHER_CH7(value)                  (AFEC_CHER_CH7_Msk & (_UINT32_(value) << AFEC_CHER_CH7_Pos)) /* Assigment of value for CH7 in the AFEC_CHER register */
#define AFEC_CHER_CH8_Pos                     _UINT32_(8)                                          /* (AFEC_CHER) Channel 8 Enable Position */
#define AFEC_CHER_CH8_Msk                     (_UINT32_(0x1) << AFEC_CHER_CH8_Pos)                 /* (AFEC_CHER) Channel 8 Enable Mask */
#define AFEC_CHER_CH8(value)                  (AFEC_CHER_CH8_Msk & (_UINT32_(value) << AFEC_CHER_CH8_Pos)) /* Assigment of value for CH8 in the AFEC_CHER register */
#define AFEC_CHER_CH9_Pos                     _UINT32_(9)                                          /* (AFEC_CHER) Channel 9 Enable Position */
#define AFEC_CHER_CH9_Msk                     (_UINT32_(0x1) << AFEC_CHER_CH9_Pos)                 /* (AFEC_CHER) Channel 9 Enable Mask */
#define AFEC_CHER_CH9(value)                  (AFEC_CHER_CH9_Msk & (_UINT32_(value) << AFEC_CHER_CH9_Pos)) /* Assigment of value for CH9 in the AFEC_CHER register */
#define AFEC_CHER_CH10_Pos                    _UINT32_(10)                                         /* (AFEC_CHER) Channel 10 Enable Position */
#define AFEC_CHER_CH10_Msk                    (_UINT32_(0x1) << AFEC_CHER_CH10_Pos)                /* (AFEC_CHER) Channel 10 Enable Mask */
#define AFEC_CHER_CH10(value)                 (AFEC_CHER_CH10_Msk & (_UINT32_(value) << AFEC_CHER_CH10_Pos)) /* Assigment of value for CH10 in the AFEC_CHER register */
#define AFEC_CHER_CH11_Pos                    _UINT32_(11)                                         /* (AFEC_CHER) Channel 11 Enable Position */
#define AFEC_CHER_CH11_Msk                    (_UINT32_(0x1) << AFEC_CHER_CH11_Pos)                /* (AFEC_CHER) Channel 11 Enable Mask */
#define AFEC_CHER_CH11(value)                 (AFEC_CHER_CH11_Msk & (_UINT32_(value) << AFEC_CHER_CH11_Pos)) /* Assigment of value for CH11 in the AFEC_CHER register */
#define AFEC_CHER_Msk                         _UINT32_(0x00000FFF)                                 /* (AFEC_CHER) Register Mask  */

#define AFEC_CHER_CH_Pos                      _UINT32_(0)                                          /* (AFEC_CHER Position) Channel xx Enable */
#define AFEC_CHER_CH_Msk                      (_UINT32_(0xFFF) << AFEC_CHER_CH_Pos)                /* (AFEC_CHER Mask) CH */
#define AFEC_CHER_CH(value)                   (AFEC_CHER_CH_Msk & (_UINT32_(value) << AFEC_CHER_CH_Pos)) 

