Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/afec.h
#define AFEC_IDR_EOC_Pos                      _UINT32_(0)                                          /* (AFEC_IDR Position) End of Conversion Interrupt Disable x */
#define AFEC_IDR_EOC_Msk                      (_UINT32_(0xFFF) << AFEC_IDR_EOC_Pos)                /* (AFEC_IDR Mask) EOC */
#define AFEC_IDR_EOC(value)                   (AFEC_IDR_EOC_Msk & (_UINT32_(value) << AFEC_IDR_EOC_Pos)) 

/* -------- AFEC_IMR : (AFEC Offset: 0x2C) ( R/ 32) AFEC Interrupt Mask Register -------- */
#define AFEC_IMR_EOC0_Pos                     _UINT32_(0)                                          /* (AFEC_IMR) End of Conversion Interrupt Mask 0 Position */
#define AFEC_IMR_EOC0_Msk                     (_UINT32_(0x1) << AFEC_IMR_EOC0_Pos)                 /* (AFEC_IMR) End of Conversion Interrupt Mask 0 Mask */
#define AFEC_IMR_EOC0(value)                  (AFEC_IMR_EOC0_Msk & (_UINT32_(value) << AFEC_IMR_EOC0_Pos)) /* Assigment of value for EOC0 in the AFEC_IMR register */
#define AFEC_IMR_EOC1_Pos                     _UINT32_(1)                                          /* (AFEC_IMR) End of Conversion Interrupt Mask 1 Position */
#define AFEC_IMR_EOC1_Msk                     (_UINT32_(0x1) << AFEC_IMR_EOC1_Pos)                 /* (AFEC_IMR) End of Conversion Interrupt Mask 1 Mask */
#define AFEC_IMR_EOC1(value)                  (AFEC_IMR_EOC1_Msk & (_UINT32_(value) << AFEC_IMR_EOC1_Pos)) /* Assigment of value for EOC1 in the AFEC_IMR register */
#define AFEC_IMR_EOC2_Pos                     _UINT32_(2)                                          /* (AFEC_IMR) End of Conversion Interrupt Mask 2 Position */
#define AFEC_IMR_EOC2_Msk                     (_UINT32_(0x1) << AFEC_IMR_EOC2_Pos)                 /* (AFEC_IMR) End of Conversion Interrupt Mask 2 Mask */
#define AFEC_IMR_EOC2(value)                  (AFEC_IMR_EOC2_Msk & (_UINT32_(value) << AFEC_IMR_EOC2_Pos)) /* Assigment of value for EOC2 in the AFEC_IMR register */
#define AFEC_IMR_EOC3_Pos                     _UINT32_(3)                                          /* (AFEC_IMR) End of Conversion Interrupt Mask 3 Position */
#define AFEC_IMR_EOC3_Msk                     (_UINT32_(0x1) << AFEC_IMR_EOC3_Pos)                 /* (AFEC_IMR) End of Conversion Interrupt Mask 3 Mask */
#define AFEC_IMR_EOC3(value)                  (AFEC_IMR_EOC3_Msk & (_UINT32_(value) << AFEC_IMR_EOC3_Pos)) /* Assigment of value for EOC3 in the AFEC_IMR register */
#define AFEC_IMR_EOC4_Pos                     _UINT32_(4)                                          /* (AFEC_IMR) End of Conversion Interrupt Mask 4 Position */
#define AFEC_IMR_EOC4_Msk                     (_UINT32_(0x1) << AFEC_IMR_EOC4_Pos)                 /* (AFEC_IMR) End of Conversion Interrupt Mask 4 Mask */
#define AFEC_IMR_EOC4(value)                  (AFEC_IMR_EOC4_Msk & (_UINT32_(value) << AFEC_IMR_EOC4_Pos)) /* Assigment of value for EOC4 in the AFEC_IMR register */
#define AFEC_IMR_EOC5_Pos                     _UINT32_(5)                                          /* (AFEC_IMR) End of Conversion Interrupt Mask 5 Position */
#define AFEC_IMR_EOC5_Msk                     (_UINT32_(0x1) << AFEC_IMR_EOC5_Pos)                 /* (AFEC_IMR) End of Conversion Interrupt Mask 5 Mask */
#define AFEC_IMR_EOC5(value)                  (AFEC_IMR_EOC5_Msk & (_UINT32_(value) << AFEC_IMR_EOC5_Pos)) /* Assigment of value for EOC5 in the AFEC_IMR register */
#define AFEC_IMR_EOC6_Pos                     _UINT32_(6)                                          /* (AFEC_IMR) End of Conversion Interrupt Mask 6 Position */
#define AFEC_IMR_EOC6_Msk                     (_UINT32_(0x1) << AFEC_IMR_EOC6_Pos)                 /* (AFEC_IMR) End of Conversion Interrupt Mask 6 Mask */
#define AFEC_IMR_EOC6(value)                  (AFEC_IMR_EOC6_Msk & (_UINT32_(value) << AFEC_IMR_EOC6_Pos)) /* Assigment of value for EOC6 in the AFEC_IMR register */
#define AFEC_IMR_EOC7_Pos                     _UINT32_(7)                                          /* (AFEC_IMR) End of Conversion Interrupt Mask 7 Position */
#define AFEC_IMR_EOC7_Msk                     (_UINT32_(0x1) << AFEC_IMR_EOC7_Pos)                 /* (AFEC_IMR) End of Conversion Interrupt Mask 7 Mask */
#define AFEC_IMR_EOC7(value)                  (AFEC_IMR_EOC7_Msk & (_UINT32_(value) << AFEC_IMR_EOC7_Pos)) /* Assigment of value for EOC7 in the AFEC_IMR register */
#define AFEC_IMR_EOC8_Pos                     _UINT32_(8)                                          /* (AFEC_IMR) End of Conversion Interrupt Mask 8 Position */
#define AFEC_IMR_EOC8_Msk                     (_UINT32_(0x1) << AFEC_IMR_EOC8_Pos)                 /* (AFEC_IMR) End of Conversion Interrupt Mask 8 Mask */
#define AFEC_IMR_EOC8(value)                  (AFEC_IMR_EOC8_Msk & (_UINT32_(value) << AFEC_IMR_EOC8_Pos)) /* Assigment of value for EOC8 in the AFEC_IMR register */
#define AFEC_IMR_EOC9_Pos                     _UINT32_(9)                                          /* (AFEC_IMR) End of Conversion Interrupt Mask 9 Position */
#define AFEC_IMR_EOC9_Msk                     (_UINT32_(0x1) << AFEC_IMR_EOC9_Pos)                 /* (AFEC_IMR) End of Conversion Interrupt Mask 9 Mask */
#define AFEC_IMR_EOC9(value)                  (AFEC_IMR_EOC9_Msk & (_UINT32_(value) << AFEC_IMR_EOC9_Pos)) /* Assigment of value for EOC9 in the AFEC_IMR register */
#define AFEC_IMR_EOC10_Pos                    _UINT32_(10)                                         /* (AFEC_IMR) End of Conversion Interrupt Mask 10 Position */
#define AFEC_IMR_EOC10_Msk                    (_UINT32_(0x1) << AFEC_IMR_EOC10_Pos)                /* (AFEC_IMR) End of Conversion Interrupt Mask 10 Mask */
#define AFEC_IMR_EOC10(value)                 (AFEC_IMR_EOC10_Msk & (_UINT32_(value) << AFEC_IMR_EOC10_Pos)) /* Assigment of value for EOC10 in the AFEC_IMR register */
#define AFEC_IMR_EOC11_Pos                    _UINT32_(11)                                         /* (AFEC_IMR) End of Conversion Interrupt Mask 11 Position */
#define AFEC_IMR_EOC11_Msk                    (_UINT32_(0x1) << AFEC_IMR_EOC11_Pos)                /* (AFEC_IMR) End of Conversion Interrupt Mask 11 Mask */
#define AFEC_IMR_EOC11(value)                 (AFEC_IMR_EOC11_Msk & (_UINT32_(value) << AFEC_IMR_EOC11_Pos)) /* Assigment of value for EOC11 in the AFEC_IMR register */
#define AFEC_IMR_DRDY_Pos                     _UINT32_(24)                                         /* (AFEC_IMR) Data Ready Interrupt Mask Position */
#define AFEC_IMR_DRDY_Msk                     (_UINT32_(0x1) << AFEC_IMR_DRDY_Pos)                 /* (AFEC_IMR) Data Ready Interrupt Mask Mask */
#define AFEC_IMR_DRDY(value)                  (AFEC_IMR_DRDY_Msk & (_UINT32_(value) << AFEC_IMR_DRDY_Pos)) /* Assigment of value for DRDY in the AFEC_IMR register */
#define AFEC_IMR_GOVRE_Pos                    _UINT32_(25)                                         /* (AFEC_IMR) General Overrun Error Interrupt Mask Position */
#define AFEC_IMR_GOVRE_Msk                    (_UINT32_(0x1) << AFEC_IMR_GOVRE_Pos)                /* (AFEC_IMR) General Overrun Error Interrupt Mask Mask */
#define AFEC_IMR_GOVRE(value)                 (AFEC_IMR_GOVRE_Msk & (_UINT32_(value) << AFEC_IMR_GOVRE_Pos)) /* Assigment of value for GOVRE in the AFEC_IMR register */
#define AFEC_IMR_COMPE_Pos                    _UINT32_(26)                                         /* (AFEC_IMR) Comparison Event Interrupt Mask Position */
#define AFEC_IMR_COMPE_Msk                    (_UINT32_(0x1) << AFEC_IMR_COMPE_Pos)                /* (AFEC_IMR) Comparison Event Interrupt Mask Mask */
#define AFEC_IMR_COMPE(value)                 (AFEC_IMR_COMPE_Msk & (_UINT32_(value) << AFEC_IMR_COMPE_Pos)) /* Assigment of value for COMPE in the AFEC_IMR register */
#define AFEC_IMR_TEMPCHG_Pos                  _UINT32_(30)                                         /* (AFEC_IMR) Temperature Change Interrupt Mask Position */
#define AFEC_IMR_TEMPCHG_Msk                  (_UINT32_(0x1) << AFEC_IMR_TEMPCHG_Pos)              /* (AFEC_IMR) Temperature Change Interrupt Mask Mask */
#define AFEC_IMR_TEMPCHG(value)               (AFEC_IMR_TEMPCHG_Msk & (_UINT32_(value) << AFEC_IMR_TEMPCHG_Pos)) /* Assigment of value for TEMPCHG in the AFEC_IMR register */
#define AFEC_IMR_Msk                          _UINT32_(0x47000FFF)                                 /* (AFEC_IMR) Register Mask  */

