Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/bootloader/firmware/src/packs/PIC32CZ2051CA70144_DFP/component/afec.h
/* -------- AFEC_CVR : (AFEC Offset: 0xD4) (R/W 32) AFEC Correction Values Register -------- */
#define AFEC_CVR_OFFSETCORR_Pos               _UINT32_(0)                                          /* (AFEC_CVR) Offset Correction Position */
#define AFEC_CVR_OFFSETCORR_Msk               (_UINT32_(0xFFFF) << AFEC_CVR_OFFSETCORR_Pos)        /* (AFEC_CVR) Offset Correction Mask */
#define AFEC_CVR_OFFSETCORR(value)            (AFEC_CVR_OFFSETCORR_Msk & (_UINT32_(value) << AFEC_CVR_OFFSETCORR_Pos)) /* Assigment of value for OFFSETCORR in the AFEC_CVR register */
#define AFEC_CVR_GAINCORR_Pos                 _UINT32_(16)                                         /* (AFEC_CVR) Gain Correction Position */
#define AFEC_CVR_GAINCORR_Msk                 (_UINT32_(0xFFFF) << AFEC_CVR_GAINCORR_Pos)          /* (AFEC_CVR) Gain Correction Mask */
#define AFEC_CVR_GAINCORR(value)              (AFEC_CVR_GAINCORR_Msk & (_UINT32_(value) << AFEC_CVR_GAINCORR_Pos)) /* Assigment of value for GAINCORR in the AFEC_CVR register */
#define AFEC_CVR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (AFEC_CVR) Register Mask  */


/* -------- AFEC_CECR : (AFEC Offset: 0xD8) (R/W 32) AFEC Channel Error Correction Register -------- */
#define AFEC_CECR_ECORR0_Pos                  _UINT32_(0)                                          /* (AFEC_CECR) Error Correction Enable for channel 0 Position */
#define AFEC_CECR_ECORR0_Msk                  (_UINT32_(0x1) << AFEC_CECR_ECORR0_Pos)              /* (AFEC_CECR) Error Correction Enable for channel 0 Mask */
#define AFEC_CECR_ECORR0(value)               (AFEC_CECR_ECORR0_Msk & (_UINT32_(value) << AFEC_CECR_ECORR0_Pos)) /* Assigment of value for ECORR0 in the AFEC_CECR register */
#define AFEC_CECR_ECORR1_Pos                  _UINT32_(1)                                          /* (AFEC_CECR) Error Correction Enable for channel 1 Position */
#define AFEC_CECR_ECORR1_Msk                  (_UINT32_(0x1) << AFEC_CECR_ECORR1_Pos)              /* (AFEC_CECR) Error Correction Enable for channel 1 Mask */
#define AFEC_CECR_ECORR1(value)               (AFEC_CECR_ECORR1_Msk & (_UINT32_(value) << AFEC_CECR_ECORR1_Pos)) /* Assigment of value for ECORR1 in the AFEC_CECR register */
#define AFEC_CECR_ECORR2_Pos                  _UINT32_(2)                                          /* (AFEC_CECR) Error Correction Enable for channel 2 Position */
#define AFEC_CECR_ECORR2_Msk                  (_UINT32_(0x1) << AFEC_CECR_ECORR2_Pos)              /* (AFEC_CECR) Error Correction Enable for channel 2 Mask */
#define AFEC_CECR_ECORR2(value)               (AFEC_CECR_ECORR2_Msk & (_UINT32_(value) << AFEC_CECR_ECORR2_Pos)) /* Assigment of value for ECORR2 in the AFEC_CECR register */
#define AFEC_CECR_ECORR3_Pos                  _UINT32_(3)                                          /* (AFEC_CECR) Error Correction Enable for channel 3 Position */
#define AFEC_CECR_ECORR3_Msk                  (_UINT32_(0x1) << AFEC_CECR_ECORR3_Pos)              /* (AFEC_CECR) Error Correction Enable for channel 3 Mask */
#define AFEC_CECR_ECORR3(value)               (AFEC_CECR_ECORR3_Msk & (_UINT32_(value) << AFEC_CECR_ECORR3_Pos)) /* Assigment of value for ECORR3 in the AFEC_CECR register */
#define AFEC_CECR_ECORR4_Pos                  _UINT32_(4)                                          /* (AFEC_CECR) Error Correction Enable for channel 4 Position */
#define AFEC_CECR_ECORR4_Msk                  (_UINT32_(0x1) << AFEC_CECR_ECORR4_Pos)              /* (AFEC_CECR) Error Correction Enable for channel 4 Mask */
#define AFEC_CECR_ECORR4(value)               (AFEC_CECR_ECORR4_Msk & (_UINT32_(value) << AFEC_CECR_ECORR4_Pos)) /* Assigment of value for ECORR4 in the AFEC_CECR register */
#define AFEC_CECR_ECORR5_Pos                  _UINT32_(5)                                          /* (AFEC_CECR) Error Correction Enable for channel 5 Position */
#define AFEC_CECR_ECORR5_Msk                  (_UINT32_(0x1) << AFEC_CECR_ECORR5_Pos)              /* (AFEC_CECR) Error Correction Enable for channel 5 Mask */
#define AFEC_CECR_ECORR5(value)               (AFEC_CECR_ECORR5_Msk & (_UINT32_(value) << AFEC_CECR_ECORR5_Pos)) /* Assigment of value for ECORR5 in the AFEC_CECR register */
#define AFEC_CECR_ECORR6_Pos                  _UINT32_(6)                                          /* (AFEC_CECR) Error Correction Enable for channel 6 Position */
#define AFEC_CECR_ECORR6_Msk                  (_UINT32_(0x1) << AFEC_CECR_ECORR6_Pos)              /* (AFEC_CECR) Error Correction Enable for channel 6 Mask */
#define AFEC_CECR_ECORR6(value)               (AFEC_CECR_ECORR6_Msk & (_UINT32_(value) << AFEC_CECR_ECORR6_Pos)) /* Assigment of value for ECORR6 in the AFEC_CECR register */
#define AFEC_CECR_ECORR7_Pos                  _UINT32_(7)                                          /* (AFEC_CECR) Error Correction Enable for channel 7 Position */
#define AFEC_CECR_ECORR7_Msk                  (_UINT32_(0x1) << AFEC_CECR_ECORR7_Pos)              /* (AFEC_CECR) Error Correction Enable for channel 7 Mask */
#define AFEC_CECR_ECORR7(value)               (AFEC_CECR_ECORR7_Msk & (_UINT32_(value) << AFEC_CECR_ECORR7_Pos)) /* Assigment of value for ECORR7 in the AFEC_CECR register */
#define AFEC_CECR_ECORR8_Pos                  _UINT32_(8)                                          /* (AFEC_CECR) Error Correction Enable for channel 8 Position */
#define AFEC_CECR_ECORR8_Msk                  (_UINT32_(0x1) << AFEC_CECR_ECORR8_Pos)              /* (AFEC_CECR) Error Correction Enable for channel 8 Mask */
#define AFEC_CECR_ECORR8(value)               (AFEC_CECR_ECORR8_Msk & (_UINT32_(value) << AFEC_CECR_ECORR8_Pos)) /* Assigment of value for ECORR8 in the AFEC_CECR register */
#define AFEC_CECR_ECORR9_Pos                  _UINT32_(9)                                          /* (AFEC_CECR) Error Correction Enable for channel 9 Position */
#define AFEC_CECR_ECORR9_Msk                  (_UINT32_(0x1) << AFEC_CECR_ECORR9_Pos)              /* (AFEC_CECR) Error Correction Enable for channel 9 Mask */
#define AFEC_CECR_ECORR9(value)               (AFEC_CECR_ECORR9_Msk & (_UINT32_(value) << AFEC_CECR_ECORR9_Pos)) /* Assigment of value for ECORR9 in the AFEC_CECR register */
#define AFEC_CECR_ECORR10_Pos                 _UINT32_(10)                                         /* (AFEC_CECR) Error Correction Enable for channel 10 Position */
#define AFEC_CECR_ECORR10_Msk                 (_UINT32_(0x1) << AFEC_CECR_ECORR10_Pos)             /* (AFEC_CECR) Error Correction Enable for channel 10 Mask */
#define AFEC_CECR_ECORR10(value)              (AFEC_CECR_ECORR10_Msk & (_UINT32_(value) << AFEC_CECR_ECORR10_Pos)) /* Assigment of value for ECORR10 in the AFEC_CECR register */
#define AFEC_CECR_ECORR11_Pos                 _UINT32_(11)                                         /* (AFEC_CECR) Error Correction Enable for channel 11 Position */
#define AFEC_CECR_ECORR11_Msk                 (_UINT32_(0x1) << AFEC_CECR_ECORR11_Pos)             /* (AFEC_CECR) Error Correction Enable for channel 11 Mask */
#define AFEC_CECR_ECORR11(value)              (AFEC_CECR_ECORR11_Msk & (_UINT32_(value) << AFEC_CECR_ECORR11_Pos)) /* Assigment of value for ECORR11 in the AFEC_CECR register */
#define AFEC_CECR_Msk                         _UINT32_(0x00000FFF)                                 /* (AFEC_CECR) Register Mask  */

#define AFEC_CECR_ECORR_Pos                   _UINT32_(0)                                          /* (AFEC_CECR Position) Error Correction Enable for channel xx */
#define AFEC_CECR_ECORR_Msk                   (_UINT32_(0xFFF) << AFEC_CECR_ECORR_Pos)             /* (AFEC_CECR Mask) ECORR */
#define AFEC_CECR_ECORR(value)                (AFEC_CECR_ECORR_Msk & (_UINT32_(value) << AFEC_CECR_ECORR_Pos)) 

